In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv('C:/Users/h.p/csvfiles/aapl.csv')
df.head()

        Date    Open    High     Low   Close    Volume
0   7-Jul-17  142.90  144.75  142.90  144.18  19201712
1   6-Jul-17  143.02  143.50  142.41  142.73  24128782
2   5-Jul-17  143.69  144.79  142.72  144.09  21569557
3   3-Jul-17  144.88  145.30  143.10  143.50  14277848
4  30-Jun-17  144.45  144.96  143.78  144.02  23024107

In [3]:
df.shape

(251, 6)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 251 entries, 0 to 250
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    251 non-null    object
 1   Open    251 non-null    float64
 2   High    251 non-null    float64
 3   Low     251 non-null    float64
 4   Close   251 non-null    float64
 5   Volume  251 non-null    int64
dtypes: float64(4), int64(1), object(1)
memory usage: 11.9+ KB

In [59]:
#df.dropna(inplace = True)

In [16]:
for col in df.columns:
    if df[col].dtype == 'object':
        try:
            df[col] = pd.to_datetime(df[col])
        except ValueError:
            pass

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 251 entries, 0 to 250
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    251 non-null    datetime64[ns]
 1   Open    251 non-null    float64
 2   High    251 non-null    float64
 3   Low     251 non-null    float64
 4   Close   251 non-null    float64
 5   Volume  251 non-null    int64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 11.9 KB

In [19]:
df[col]

0     1970-01-01 00:00:00.019201712
1     1970-01-01 00:00:00.024128782
2     1970-01-01 00:00:00.021569557
3     1970-01-01 00:00:00.014277848
4     1970-01-01 00:00:00.023024107
                   ...
246   1970-01-01 00:00:00.030136990
247   1970-01-01 00:00:00.038918997
248   1970-01-01 00:00:00.025892171
249   1970-01-01 00:00:00.024167463
250   1970-01-01 00:00:00.023794945
Name: Volume, Length: 251, dtype: datetime64[ns]

In [10]:
df1=df[col]

In [11]:
df1

0      19201712
1      24128782
2      21569557
3      14277848
4      23024107
         ...
246    30136990
247    38918997
248    25892171
249    24167463
250    23794945
Name: Volume, Length: 251, dtype: int64

In [12]:
df2 = df1[1:]

In [20]:
df2

1      24128782
2      21569557
3      14277848
4      23024107
5      31499368
         ...
246    30136990
247    38918997
248    25892171
249    24167463
250    23794945
Name: Volume, Length: 250, dtype: int64

In [21]:
df['difference'] = df1 - df2

In [22]:
df['difference']

0      NaN
1      0.0
2      0.0
3      0.0
4      0.0
      ...
246    0.0
247    0.0
248    0.0
249    0.0
250    0.0
Name: difference, Length: 251, dtype: float64